---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.IsValidObject
source: html/8b536d01-26ab-721a-9047-db61124ecef0.htm
---
# Autodesk.Revit.DB.CompoundStructure.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.